src/DataProcessors/СтопЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>СтопЛист</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Модифицирован</Name>
					<Comment>признак наличия изменений</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВызовИзМеню</Name>
					<Comment>признак открытия из меню</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/СтопЛист.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СтопЛист</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>вСтопе</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НовыйТовар</Name>
					<Comment>Признак добавления нового товара</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Товар</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Товары</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнформационнаяБаза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеБазы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/DataProcessors/СтопЛист/Ext/ObjectModule.bsl
#Если Клиент Тогда

Перем ТекущийКаталог Экспорт;	// используется в форме

// Обязательная процедура для работы с обработкой через ИнтерфейсРМ.ПолучитьОбъектОбработки()
// Вызывается каждый раз при обращении к объекту обработки.
// Здесь надо прописать сброс переменных в начальные значения
// Реквизиты и табличные части уже сброшены
Процедура УстановкаНачальныхЗначений() Экспорт
	
КонецПроцедуры

// Возвращает таблицу значений с позициями Стоп-листа из основного каталога товаров
//
//
Функция ПолучитьПозицииСтопЛиста() Экспорт

	ТекущийКаталог = глПараметрыРМ.ЗаказМенюОсновное;
	//Если глПараметрыРМ.ЗаказМенюВид = 1 Тогда
		// каталог надо получить из настройки кнопочного меню
		Попытка
			ПараметрыНастройки = ТекущийКаталог.ПолучитьОбъект().ПолучитьСтруктуруПараметров();
			ТекущийКаталог = ПараметрыНастройки.КаталогТоваров;
		Исключение
			ТекущийКаталог = Неопределено;
		КонецПопытки;
	//КонецЕсли; 
	
	Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	СтопЛистСрезПоследних.Товар КАК Товар,
			|	СтопЛистСрезПоследних.Остаток
			|ИЗ
			|	РегистрСведений.СтопЛист.СрезПоследних КАК СтопЛистСрезПоследних
			|ГДЕ
			|	СтопЛистСрезПоследних.ИнформационнаяБаза = &ИнформационнаяБаза
			|	И СтопЛистСрезПоследних.вСтопе
			|	И СтопЛистСрезПоследних.Товар.Владелец = &КаталогТоваров
			|
			|УПОРЯДОЧИТЬ ПО
			|	Товар.Наименование ИЕРАРХИЯ
			|");
	
	Запрос.УстановитьПараметр("ИнформационнаяБаза"	,ПараметрыСеанса.ТекущаяИБ);
	Запрос.УстановитьПараметр("КаталогТоваров"		,ТекущийКаталог);
	
	ПозицииСтопЛиста = Запрос.Выполнить().Выгрузить();
	
	Возврат ПозицииСтопЛиста;
КонецФункции
 
#КонецЕсли
